In [2]:
#import libraries
import pandas as pd

In [3]:
#load dataset
dataset=pd.read_csv("Placement.csv")

In [4]:
#from filename import class name
from univariate import Univariate

In [5]:
#creating obj for class
obj=Univariate()

In [6]:
quan,qual=obj.QuanQual(dataset)
#calling the function

sl_no
gender
ssc_p
ssc_b
hsc_p
hsc_b
hsc_s
degree_p
degree_t
workex
etest_p
specialisation
mba_p
status
salary

In [7]:
quan

['sl_no', 'ssc_p', 'hsc_p', 'degree_p', 'etest_p', 'mba_p', 'salary']

In [8]:
qual

['gender',
 'ssc_b',
 'hsc_b',
 'hsc_s',
 'degree_t',
 'workex',
 'specialisation',
 'status']

In [10]:
#creating mean as a index using DF
univarite=pd.DataFrame(index=["Mean"],columns=quan)

In [11]:
univarite

     sl_no ssc_p hsc_p degree_p etest_p mba_p salary
Mean   NaN   NaN   NaN      NaN     NaN   NaN    NaN

In [12]:
univarite["sl_no"]["Mean"]

nan

In [13]:
for columnName in quan:
    univarite[columnName]["Mean"]=dataset[columnName].mean()

In [14]:
univarite

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
Mean,108.0,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405

In [15]:
univarite=pd.DataFrame(index=["Mean","Median"],columns=quan)
for columnName in quan:
    univarite[columnName]["Mean"]=dataset[columnName].mean()
    univarite[columnName]["Median"]=dataset[columnName].median()

In [16]:
univarite

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
Mean,108.0,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
Median,108.0,67.0,65.0,66.0,71.0,62.0,265000.0

In [17]:
univarite=pd.DataFrame(index=["Mean","Median","Mode"],columns=quan)
for columnName in quan:
    univarite[columnName]["Mean"]=dataset[columnName].mean()
    univarite[columnName]["Median"]=dataset[columnName].median()
    univarite[columnName]["Mode"]=dataset[columnName].mode()

In [18]:
univarite

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
Mean,108.0,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
Median,108.0,67.0,65.0,66.0,71.0,62.0,265000.0
Mode,0 1 1 2 2 3 3 4 4 ...,"0 62.0 Name: ssc_p, dtype: float64","0 63.0 Name: hsc_p, dtype: float64","0 65.0 Name: degree_p, dtype: float64","0 60.0 Name: etest_p, dtype: float64","0 56.7 Name: mba_p, dtype: float64","0 300000.0 Name: salary, dtype: float64"

In [19]:
dataset["ssc_p"].mode()[0]

62.0

In [20]:
univarite=pd.DataFrame(index=["Mean","Median","Mode"],columns=quan)
for columnName in quan:
    univarite[columnName]["Mean"]=dataset[columnName].mean()
    univarite[columnName]["Median"]=dataset[columnName].median()
    univarite[columnName]["Mode"]=dataset[columnName].mode()[0]

In [21]:
univarite

,sl_no,ssc_p,hsc_p,degree_p,etest_p,mba_p,salary
Mean,108.0,67.303395,66.333163,66.370186,72.100558,62.278186,288655.405405
Median,108.0,67.0,65.0,66.0,71.0,62.0,265000.0
Mode,1,62.0,63.0,65.0,60.0,56.7,300000.0

In [22]:
dataset["ssc_p"].value_counts()

62.00    11
63.00    10
67.00     9
52.00     9
73.00     9
         ..
69.70     1
80.92     1
83.00     1
86.50     1
80.60     1
Name: ssc_p, Length: 103, dtype: int64

In [23]:
dataset["ssc_p"].cumsum()

0         67.00
1        146.33
2        211.33
3        267.33
4        353.13
         ...
210    14209.23
211    14267.23
212    14334.23
213    14408.23
214    14470.23
Name: ssc_p, Length: 215, dtype: float64